/**
 * Продолжить работу с интернет-магазином:
 * 2.1. В прошлом домашнем задании вы реализовали корзину на базе массивов.
 * Какими объектами можно заменить их элементы?
 * 2.2. Реализуйте такие объекты.
 * 2.3. Перенести функционал подсчета корзины на объектно-ориентированную базу.
 */

"use strict";

const products = [
  {
    id: 1,
    name: "Яблоки",
    image: "./img/apple.jpeg",
    price: 10,
    unit: "кг.",
  },
  {
    id: 2,
    name: "Груши",
    image: "./img/pear.jpeg",
    price: 11,
    unit: "кг.",
  },
  {
    id: 3,
    name: "Виноград",
    image: "./img/grape.jpeg",
    price: 15,
    unit: "кг.",
  },
];
